<template>
  <div class="wrap">
    <div id="pdfDom" style="padding: 10px">
      <el-table :data="tableData" border>
        <el-table-column label="序号" width="250">
          <template slot-scope="scope">
            {{ scope.$index + 1 }}
          </template>
        </el-table-column>
        <el-table-column prop="date" label="日期" width="250"></el-table-column>
        <el-table-column prop="name" label="姓名" width="250"></el-table-column>
        <el-table-column prop="address" label="地址"></el-table-column>
      </el-table>
    </div>
    <button type="button" style="margin-top: 20px" @click="btnClick">导出PDF</button>
  </div>
</template>

<script>
export default {
  data() {
    return {
      exportPDFtitle: '页面导出PDF文件名',
      tableData: [
        {
          date: '2016-05-06',
          name: '王小虎',
          address:
            '重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address:
            '重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address:
            '重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address:
            '重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address:
            '重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address:
            '重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address:
            '重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address:
            '重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address:
            '重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address:
            '重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address:
            '重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address:
            '重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        },
        {
          date: '2016-05-06',
          name: '王小虎',
          address: '重庆市九龙坡区火炬大道'
        }
      ]
    }
  },
  methods: {
    btnClick() {
      this.$nextTick(() => {
        this.getPdf({
          id: 'pdfDom'
        })
      })
    }
  }
}
</script>
